#+LATEX_CLASS: elsarticle
#+LATEX_CLASS_OPTIONS: [number, sort&compress, review, 12pt]
#+EXPORT_EXCLUDE_TAGS: noexport
#+OPTIONS: toc:nil ^:{} author:nil

#+latex_header: \usepackage[utf8]{inputenc}
#+latex_header: \usepackage{fixltx2e}
#+latex_header: \usepackage{url}
#+latex_header: \usepackage[version=3]{mhchem}
#+latex_header: \usepackage{graphicx}
#+latex_header: \usepackage{color}
#+latex_header: \usepackage{amsmath}
#+latex_header: \usepackage{textcomp}
#+latex_header: \usepackage{wasysym}
#+latex_header: \usepackage{latexsym}
#+latex_header: \usepackage{amssymb}
#+LATEX_HEADER: \usepackage[linktocpage,
#+LATEX_HEADER:   pdfstartview=FitH,
#+LATEX_HEADER:   colorlinks,
#+LATEX_HEADER:   linkcolor=blue,
#+LATEX_HEADER:   anchorcolor=blue,
#+LATEX_HEADER:   citecolor=blue,
#+LATEX_HEADER:   filecolor=blue,
#+LATEX_HEADER:   menucolor=blue,
#+LATEX_HEADER:   urlcolor=blue]{hyperref}
#+latex_header: \usepackage{attachfile}
#+latex_header: \usepackage{longtable}
#+LATEX_HEADER: \usepackage{minted}
#+LATEX_HEADER: \usemintedstyle{emacs}
#+LATEX_HEADER: \newminted{python}{fontsize=\footnotesize}

\begin{frontmatter}
\title{Core-level shifts in Cu-Pd alloys as a function of bulk composition and structure}

\author[cmu]{Jacob Boes}
\author[cmu]{Peter Kondratyuk}
\author[cmu]{Chunrong Yin}
\author[cmu]{James B. Miller}
\author[cmu]{Andrew J. Gellman}
\author[cmu]{John R. Kitchin\corref{cor}}
\ead{jkitchin@andrew.cmu.edu}

\address[cmu]{Department of Chemical Engineering, Carnegie Mellon University, Pittsburgh, PA 15213}

\cortext[cor]{Corresponding author}
\end{frontmatter}

\tableofcontents

* Introduction
This document contains supporting data for the work, "Core-level shifts in Cu-Pd alloys as a function of bulk composition and structure." To make our work transparent and reproducible, we have stored most of the data used in this work in the JSON data format (http://www.json.org). The remaining data can be found in the tables at the end of this paper. The JSON file can be found here:

\attachfile{data.json}{(double-click to open)}.

JSON is a human-readable, language-independent data format. Code for parsing and generating JSON data is readily available in a large variety of programming languages including C, C++, Java, Python, Perl, etc... We have used Python to read and write JSON data for all the examples below. Data inside the JSON file can also be viewed using online resources such as the viewer found here: http://www.jsoneditoronline.org/. Although there are many ways to interface with the data stored in the JSON file, we utilize the ASE database tool specifically designed for storing information about atoms objects. Further documentation on the ASE database and its features can be found here: https://wiki.fysik.dtu.dk/ase/ase/db/db.html. We organize information from the VASP calculations using descriptive keywords, which define the purpose of each calculation. A full list of the keywords used to categorize each calculation can be found in the code block below. Examples of how data is pulled from the database using this tool can be seen throughout the rest of the supporting information file.

#+BEGIN_SRC python
from ase.db import connect
from textwrap import fill
db = connect('data.json')

# Select all entries in the ASE database.
entries = db.select()

all_keywords = []
for entry in entries:
    all_keywords.extend(entry.keywords)

print fill('\n'.join(set(all_keywords)))
#+END_SRC

#+RESULTS:
: 42 24atom 54atom I5C0 0.45lat 0.75Cu I2C1 0.62Cu 0 4 RN GS 0.25Cu I2C0
: 0.67Cu I2C2 59 58 0.00Cu 54 57 56 51 50 53 52 55 dis I5C2 I5C1 I4C3 3
: I1C0 I3C1 I3C0 I3C2 72atom 0.88Cu 39 38 33 32 37 36 35 34 ensam
: 0.35lat 60 61 62 63 I4C4 I4C2 0.12Cu I4C0 I4C1 1.05frac I0C0 2 0.50lat
: 0.50Cu 0.55lat 1.00frac 0.50Cu-wid 0.38Cu 64atom 48 49 46 47 44 45
: 0.95frac 43 40 41 1 5 0.33Cu fcc 0.40lat bcc 0.17Cu 0cl 1.00Cu 1cl

* Getting the Computational Details of a Calculation from the JSON file
Here is an example of opening the JSON file using the ASE database tool, and printing the calculation details for a single calculation. First we print all of the information stored and then show how specific information can be taken directly from the database, such as calculator INCAR parameters and total energy of the calculation.

#+BEGIN_SRC python
from ase.db import connect
from textwrap import fill

db = connect('data.json')

# Select a specific entry in the database
example = db.select(['fcc', 'GS', '24atom', '0cl', '1.00Cu'])

# ASE database utilizes generator objects. To access the first,
# and only entry in this generator, we use '.next()'.
example = example.next()

# Here we print all of the information stored in the database
print fill(str(example)), '\n'

# Specific information can be pulled from the database by
# specifying the appropriate sub-dictionary name. This is
# shown for the INCAR parameters:
print 'The INCAR parameters:'
print fill(str(example.calculator_parameters.incar)), '\n'

# Here we print the total energy of the calculation:
print 'The total energy:'
print '{0} eV'.format(example.energy)
#+END_SRC

#+RESULTS:
#+begin_example
{u'ctime': 14.923533301677663, u'tags': array([0, 0, 0, 0, 0, 0, 0, 0,
0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,        0]), u'positions':
array([[  0.00000000e+00,   0.00000000e+00,   0.00000000e+00],
[  2.79036996e-03,   1.80604130e+00,   1.84393680e+00],        [
1.81516350e+00,   1.79791882e+00,   1.10173588e-02],        [
1.81795387e+00,   3.60396012e+00,   1.85495416e+00],        [
3.63032700e+00,   3.59583765e+00,   2.20347177e-02],        [
3.63311737e+00,   5.40187894e+00,   1.86597152e+00],        [
1.81752002e+00,   8.56811893e-03,   1.83808050e+00],        [
1.82031039e+00,   1.81460942e+00,   3.68201731e+00],        [
3.63268352e+00,   1.80648694e+00,   1.84909786e+00],        [
3.63547389e+00,   3.61252824e+00,   3.69303467e+00],        [
5.44784702e+00,   3.60440576e+00,   1.86011522e+00],        [
5.45063739e+00,   5.41044706e+00,   3.70405203e+00],        [
3.63504004e+00,   1.71362379e-02,   3.67616101e+00],        [
3.63783041e+00,   1.82317754e+00,   5.52009781e+00],        [
5.45020354e+00,   1.81505506e+00,   3.68717837e+00],        [
5.45299391e+00,   3.62109636e+00,   5.53111517e+00],        [
7.26536704e+00,   3.61297388e+00,   3.69819573e+00],        [
7.26815741e+00,   5.41901518e+00,   5.54213253e+00],        [
5.45256006e+00,   2.57043568e-02,   5.51424151e+00],        [
5.45535043e+00,   1.83174565e+00,   7.35817832e+00],        [
7.26772356e+00,   1.82362318e+00,   5.52525887e+00],        [
7.27051393e+00,   3.62966448e+00,   7.36919568e+00],        [
9.08288706e+00,   3.62154200e+00,   5.53627623e+00],        [
9.08567743e+00,   5.42758330e+00,   7.38021303e+00]]), u'energy':
-89.298417, u'calculator_parameters': {u'incar': {u'ediffg': -0.02,
u'doc': u'INCAR parameters', u'prec': u'Normal', u'nsim': 4, u'isif':
3, u'nbands': 160, u'ibrion': 2, u'lplane': True, u'encut': 400.0,
u'ismear': 1, u'ediff': 1e-06, u'npar': 4, u'nsw': 10}, u'doc': u'JSON
representation of a VASP calculation.\n\nenergy is in eV\nforces are
in eV/\\AA\nstress is in GPa (sxx, syy, szz,  syz, sxz, sxy)\nmagnetic
moments are in Bohr-magneton\nThe density of states is reported with
E_f at 0 eV.\nVolume is reported in \\AA^3\nCoordinates and cell
parameters are reported in \\AA\n\nIf atom-projected dos are included
they are in the form:\n{ados:{energy:data, {atom index: {orbital :
dos}}}\n', u'potcar': [[u'Cu', u'potpaw_PBE/Cu/POTCAR',
u'a44c591415026f53deb16a99ca3f06b1e69be10b']], u'input': {u'kpts':
array([3, 4, 7]), u'reciprocal': False, u'xc': u'PBE',
u'kpts_nintersections': None, u'setups': None, u'txt': u'-', u'gamma':
False}, u'atoms': {u'cell': array([[  7.27008008e+00,
3.42724757e-02,   7.35232202e+00],        [  5.44549051e+00,
5.39375647e+00,   3.30520765e-02],        [  5.58073992e-03,
3.61208260e+00,   3.68787361e+00]]), u'symbols': [u'Cu', u'Cu', u'Cu',
u'Cu', u'Cu', u'Cu', u'Cu', u'Cu', u'Cu', u'Cu', u'Cu', u'Cu', u'Cu',
u'Cu', u'Cu', u'Cu', u'Cu', u'Cu', u'Cu', u'Cu', u'Cu', u'Cu', u'Cu',
u'Cu'], u'tags': array([0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
0, 0, 0, 0, 0, 0, 0, 0,        0]), u'pbc': array([ True,  True,
True], dtype=bool), u'positions': array([[  0.00000000e+00,
0.00000000e+00,   0.00000000e+00],        [  2.79036996e-03,
1.80604130e+00,   1.84393680e+00],        [  1.81516350e+00,
1.79791882e+00,   1.10173588e-02],        [  1.81795387e+00,
3.60396012e+00,   1.85495416e+00],        [  3.63032700e+00,
3.59583765e+00,   2.20347177e-02],        [  3.63311737e+00,
5.40187894e+00,   1.86597152e+00],        [  1.81752002e+00,
8.56811893e-03,   1.83808050e+00],        [  1.82031039e+00,
1.81460942e+00,   3.68201731e+00],        [  3.63268352e+00,
1.80648694e+00,   1.84909786e+00],        [  3.63547389e+00,
3.61252824e+00,   3.69303467e+00],        [  5.44784702e+00,
3.60440576e+00,   1.86011522e+00],        [  5.45063739e+00,
5.41044706e+00,   3.70405203e+00],        [  3.63504004e+00,
1.71362379e-02,   3.67616101e+00],        [  3.63783041e+00,
1.82317754e+00,   5.52009781e+00],        [  5.45020354e+00,
1.81505506e+00,   3.68717837e+00],        [  5.45299391e+00,
3.62109636e+00,   5.53111517e+00],        [  7.26536704e+00,
3.61297388e+00,   3.69819573e+00],        [  7.26815741e+00,
5.41901518e+00,   5.54213253e+00],        [  5.45256006e+00,
2.57043568e-02,   5.51424151e+00],        [  5.45535043e+00,
1.83174565e+00,   7.35817832e+00],        [  7.26772356e+00,
1.82362318e+00,   5.52525887e+00],        [  7.27051393e+00,
3.62966448e+00,   7.36919568e+00],        [  9.08288706e+00,
3.62154200e+00,   5.53627623e+00],        [  9.08567743e+00,
5.42758330e+00,   7.38021303e+00]])}, u'data': {u'stress': array([
0.00044062,  0.00117381,  0.00037976,  0.00119491,  0.00035132,
-0.00011941]), u'doc': u'Data from the output of the calculation',
u'volume': 287.452162285601, u'total_energy': -89.298417, u'forces':
array([[ 0.,  0.,  0.],        [ 0.,  0.,  0.],        [ 0.,  0.,
0.],        [ 0.,  0.,  0.],        [ 0.,  0.,  0.],        [ 0.,  0.,
0.],        [ 0.,  0.,  0.],        [ 0.,  0.,  0.],        [ 0.,  0.,
0.],        [ 0.,  0.,  0.],        [ 0.,  0.,  0.],        [ 0.,  0.,
0.],        [ 0.,  0.,  0.],        [ 0.,  0.,  0.],        [ 0.,  0.,
0.],        [ 0.,  0.,  0.],        [ 0.,  0.,  0.],        [ 0.,  0.,
0.],        [ 0.,  0.,  0.],        [ 0.,  0.,  0.],        [ 0.,  0.,
0.],        [ 0.,  0.,  0.],        [ 0.,  0.,  0.],        [ 0.,  0.,
0.]]), u'fermi_level': 3.685}, u'metadata': {u'date.created':
1398438581.016546, u'uuid': u'a01f2baa-cc8b-11e3-b664-003048f5e49e',
u'date.created.ascii': u'Fri Apr 25 11:09:41 2014', u'user.username':
None, u'atoms.resort': array([ 0,  1,  2,  3,  4,  5,  6,  7,  8,  9,
10, 11, 12, 13, 14, 15, 16,        17, 18, 19, 20, 21, 22, 23]),
u'user.email': None, u'user.fullname': None, u'Cu.potential.git_hash':
u'a44c591415026f53deb16a99ca3f06b1e69be10b', u'atoms.tags': array([0,
0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
0]), u'Cu.potential.path': u'potpaw_PBE/Cu/POTCAR'}}, 'id': 26,
u'cell': array([[  7.27008008e+00,   3.42724757e-02,
7.35232202e+00],        [  5.44549051e+00,   5.39375647e+00,
3.30520765e-02],        [  5.58073992e-03,   3.61208260e+00,
3.68787361e+00]]), u'numbers': array([29, 29, 29, 29, 29, 29, 29, 29,
29, 29, 29, 29, 29, 29, 29, 29, 29,        29, 29, 29, 29, 29, 29,
29]), u'pbc': array([ True,  True,  True], dtype=bool), u'mtime':
14.923533301677663, u'keywords': [u'fcc', u'GS', u'24atom', u'0cl',
u'1.00Cu'], u'unique_id': u'f1a4a3c4f9a54c9878026ba21390287b',
u'composition': 1.0, u'calculator': u'vasp', u'user': u'jboes'} 

The INCAR parameters:
{u'encut': 400.0, u'ediff': 1e-06, u'doc': u'INCAR parameters',
u'prec': u'Normal', u'nsim': 4, u'isif': 3, u'ibrion': 2, u'nbands':
160, u'ediffg': -0.02, u'ismear': 1, u'lplane': True, u'npar': 4,
u'nsw': 10} 

The total energy:
-89.298417 eV
#+end_example

